In [2]:

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib 
matplotlib.rcParams["figure.figsize"] = (20,10)

In [2]:
df=pd.read_csv("C:\\Users\\HP\\AppData\\Local\\Temp\\3378550f-2e5b-4869-9c1a-f479fd38233b_archive.zip.33b\\Bengaluru_House_Data.csv")
df.head()

NameError: name 'pd' is not defined

In [6]:
df.shape

(13320, 9)

In [7]:
df.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [8]:
df['area_type'].unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [9]:
df['area_type'].value_counts()

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64

In [11]:
# Drop features that are not required to build our model
df1=df.drop(['area_type','availability','society','balcony'],axis='columns')
df1.shape

(13320, 5)

In [13]:
# Data Cleaning: Handle NA values
df1.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [14]:
df1.shape

(13320, 5)

In [15]:
df2=df1.dropna()
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [16]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [18]:
df2['bhk']=df2['size'].apply(lambda x:int(x.split(' ')[0]))
df2

C:\Users\HP\AppData\Local\Temp\ipykernel_2332\4256967118.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['bhk']=df2['size'].apply(lambda x:int(x.split(' ')[0]))

                       location       size total_sqft  bath   price  bhk
0      Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2                   Uttarahalli      3 BHK       1440   2.0   62.00    3
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                      Kothanur      2 BHK       1200   2.0   51.00    2
...                         ...        ...        ...   ...     ...  ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00    5
13316             Richards Town      4 BHK       3600   5.0  400.00    4
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00    2
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00    4
13319              Doddathoguru      1 BHK        550   1.0   17.00    1

[13246 rows x 6 columns]

In [19]:
df2['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18])

In [20]:
df2[df2.bhk>25]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [21]:
df2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [23]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [25]:
df2[df2['total_sqft'].apply(is_float)].head(12)

                    location       size total_sqft  bath   price  bhk
0   Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1           Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2                Uttarahalli      3 BHK       1440   2.0   62.00    3
3         Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                   Kothanur      2 BHK       1200   2.0   51.00    2
5                 Whitefield      2 BHK       1170   2.0   38.00    2
6           Old Airport Road      4 BHK       2732   4.0  204.00    4
7               Rajaji Nagar      4 BHK       3300   4.0  600.00    4
8               Marathahalli      3 BHK       1310   3.0   63.25    3
9               Gandhi Bazar  6 Bedroom       1020   6.0  370.00    6
10                Whitefield      3 BHK       1800   2.0   70.00    3
11                Whitefield  4 Bedroom       2785   5.0  295.00    4

In [33]:
def convert_sqft_to_num(x):
    tokens=x.split('-')
    if len(tokens)==2:
        return(float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [39]:
df3 = df2.copy()
df3.total_sqft = df4.total_sqft.apply(convert_sqft_to_num)
df3 = df3[df4.total_sqft.notnull()]
df3.head(3)

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3

In [47]:
df3.loc[2]

location      Uttarahalli
size                3 BHK
total_sqft         1440.0
bath                  2.0
price                62.0
bhk                     3
Name: 2, dtype: object

In [48]:
# Feature Engineering
# Add new feature called price per square feet
df4=df3.copy()
df4['price_per_sqft']=df4['price']*100000/df4['total_sqft']
df4.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [49]:
df4_stats=df4['price_per_sqft'].describe()
df4_stats

count    1.320000e+04
mean     7.920759e+03
std      1.067272e+05
min      2.678298e+02
25%      4.267701e+03
50%      5.438331e+03
75%      7.317073e+03
max      1.200000e+07
Name: price_per_sqft, dtype: float64

In [50]:
df4.to_csv("bhp.csv",index=False)

In [51]:
df4.location=df4.location.apply(lambda x: x.strip())
location_stats=df4['location'].value_counts(ascending=False)
location_stats

location
Whitefield                           535
Sarjapur  Road                       392
Electronic City                      304
Kanakpura Road                       266
Thanisandra                          236
                                    ...
Duddanahalli                           1
Beml layout, Rajarajeshwari nagar      1
Sabari Nagar                           1
Ashraya Layout                         1
Whitefield ECC Road                    1
Name: count, Length: 1293, dtype: int64

In [52]:
location_stats.values.sum()

np.int64(13246)

In [53]:
len(location_stats[location_stats>10])

241

In [54]:
len(location_stats)

1293

In [55]:
len(location_stats[location_stats<=10])

1052

In [56]:
# Dimensionality Reduction
location_stats_less_than_10=location_stats[location_stats<=10]
location_stats_less_than_10

location
Nagadevanahalli                      10
Ganga Nagar                          10
Kalkere                              10
BTM 1st Stage                        10
Sector 1 HSR Layout                  10
                                     ..
Duddanahalli                          1
Beml layout, Rajarajeshwari nagar     1
Sabari Nagar                          1
Ashraya Layout                        1
Whitefield ECC Road                   1
Name: count, Length: 1052, dtype: int64

In [57]:
len(df4.location.unique())

1293

In [1]:
df4.location=df4.location.apply(lambda x:'other' if x in location_stats_less_than_10 else x)
len(df4.location.unique())

NameError: name 'df4' is not defined

In [59]:
df4.head(10)

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,370.00,6,36274.509804